backend/app/controllers/participants_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` IN (52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66)
---
  def find_user
    user_id = params[:user_id]
    user = User.find_by(id: user_id)

SELECT `assignments`.* FROM `assignments` WHERE `assignments`.`id` = 1 LIMIT 1
---
  def find_assignment
    assignment_id = params[:assignment_id]
    assignment = Assignment.find_by(id: assignment_id)